{
    "AppSec": [
      {
        "id": 1,
        "title": "Threat Modelling Analysis",
        "details": "Our experts help you <ul><li>Assess your existing applications or new application designs</li><li>Identify potential threat agents and threats</li> <li>Recommend countermeasures</li>  <li>Prioritize defense </li> </ul> Making sure your applications are secure",
        "image": "/AppSec1.jpg",
        "points": {
          "headwhy": "Why threat model?" ,
          "why": "Threat Modelling has become an increasingly important part of Secure software development lifecycle (SSDL)process and has been widely adopted to be an industry security best practice. ",
          "headwhen": "When To Perform Threat Modelling?" ,
          "when": "Optimally, threat modelling should be done at an early stage of the development as it can save significant resources on risk mitigation during a later phase.<br><br>Cyber security, threat and technology landscape is constantly evolving, it's also important to perform Threat Modelling on existing systems, applications or features to identify new threats and vulnerabilities.<br>In the absence of new feature development or enhancement, threat modelling should be revisited as part of support and maintenance activities.",
          "headhow": "What Methodologies and Tools to Use?" ,
          "how": "There are many Threat Modelling methodologies and tools and we'll primarily use Microsoft STRIDE, Mitre Att@ck, Attack Tree, DREAD and CVSS, etc.",
          "headwho": "Who should threat model?" ,
          "who": "You. Everyone. Anyone who is concerned about the privacy, safety, and security of their system."
        }
      },
      {
        "id": 2,
        "title": "Abuse Case Analysis",
        "details": "Our experts help you <ul><li>Assess your existing applications or new application designs</li><li>Identify potential threats and abuse cases</li> <li>Recommend countermeasures</li>  <li>Prioritize defense </li> </ul> Making sure your applications are secure",
        "image": "/AppSec2.jpg",
        "points": {
          "headwhy": "Why Abuse Case Analysis?" ,
          "why": "Abuse case analysis is an industry security best practice to shift security to the left by identifying potential attackers and abuse cases in design phases. ",
          "headwhen": "When To Perform Abuse Case Analysis?" ,
          "when": "Abuse case analysis as an industry security practice is often used to identify security requirements during design phases. <br><br>It can also be used to assess security gaps and vulnerabilities identified by other tools or processes",
          "headhow": "What Methodologies and Tools to Use?" ,
          "how": "We use Threat Modelling methodologies and tools to assist Abuse Case Analysis.",
          "headwho": "Who should threat model?" ,
          "who": "Everyone with good knowledge of the business use cases and involved technologies can participate and contribute."
        }
      },
      {
        "id": 3,
        "title": "Automated and Repeated Security Test",
        "details": "Our experts help you <ul><li>Integrate security test cases in your DevOps/GitOps pipelines</li><li>Define automated and repeatable security test cases</li> <li>Define security test cases to validate remediation of any vunlerabilities identified by your Cyber team</li>  <li>Provide remediation evidences </li> </ul> Making sure your applications are secure and compliant",        
        "image": "/AppSec3.jpg",
        "points": {
          "headwhy": "Why Automate and Repeat Security Test?" ,
          "why": "Traditional penetration test is manual, time consuming and costly and it's infeasible to engage manual penetration test for every single application release",
          "headwhen": "When To Automate and Repeat Security Test?" ,
          "when": "If your application worths penetration testing and there're potential abuse cases you want to avoid",
          "headhow": "What Methodologies and Tools to Use?" ,
          "how": "Our team have built our own propriety security test automation solution",
          "headwho": "Who should Automate and Repeat Security Test?" ,
          "who": "Everyone worry about your application security and has concerns on any abuse cases."
        }
      }
    ]
  }
